In [1]:
import numpy as np
import pandas as pd

In [5]:
data=np.random.randn(4,3)

In [6]:
data

array([[ 0.5032391 ,  0.26611242,  0.31223597],
       [ 0.00885554, -0.07278917, -0.04017873],
       [-1.9133097 , -0.32279082,  0.81468633],
       [-1.14433077,  0.44713815,  0.21424051]])

In [7]:
dataFrame=pd.DataFrame(data)

In [10]:
type(dataFrame[0])

pandas.core.series.Series

In [11]:
dataFrame

          0         1         2
0  0.503239  0.266112  0.312236
1  0.008856 -0.072789 -0.040179
2 -1.913310 -0.322791  0.814686
3 -1.144331  0.447138  0.214241

In [19]:
yeniDataFrame=pd.DataFrame(data,index=["Atil","Zeynep","Atlas","Mehmet"],columns=["Maas","Yas","Calısma Saati"])

In [20]:
yeniDataFrame

            Maas       Yas  Calısma Saati
Atil    0.503239  0.266112       0.312236
Zeynep  0.008856 -0.072789      -0.040179
Atlas  -1.913310 -0.322791       0.814686
Mehmet -1.144331  0.447138       0.214241

In [21]:
yeniDataFrame["Yas"]

Atil      0.266112
Zeynep   -0.072789
Atlas    -0.322791
Mehmet    0.447138
Name: Yas, dtype: float64

In [23]:
yeniDataFrame["Calısma Saati"]

Atil      0.312236
Zeynep   -0.040179
Atlas     0.814686
Mehmet    0.214241
Name: Calısma Saati, dtype: float64

In [24]:
yeniDataFrame[["Maas","Yas"]]

            Maas       Yas
Atil    0.503239  0.266112
Zeynep  0.008856 -0.072789
Atlas  -1.913310 -0.322791
Mehmet -1.144331  0.447138

In [25]:
yeniDataFrame

            Maas       Yas  Calısma Saati
Atil    0.503239  0.266112       0.312236
Zeynep  0.008856 -0.072789      -0.040179
Atlas  -1.913310 -0.322791       0.814686
Mehmet -1.144331  0.447138       0.214241

In [26]:
yeniDataFrame.loc["Atil"]

Maas             0.503239
Yas              0.266112
Calısma Saati    0.312236
Name: Atil, dtype: float64

In [27]:
yeniDataFrame.loc["Zeynep"]

Maas             0.008856
Yas             -0.072789
Calısma Saati   -0.040179
Name: Zeynep, dtype: float64

In [28]:
yeniDataFrame.iloc[1]

Maas             0.008856
Yas             -0.072789
Calısma Saati   -0.040179
Name: Zeynep, dtype: float64